
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7697206092)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_vpc_access_connector.internal-vpc-connector
* Update
  * google_artifact_registry_repository.artifact-repository


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_vpc_access_connector.internal-vpc-connector will be created
  + resource "google_vpc_access_connector" "internal-vpc-connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + machine_type       = "e2-micro"
      + max_instances      = (known after apply)
      + max_throughput     = 300
      + min_instances      = (known after apply)
      + min_throughput     = 200
      + name               = "connector"
      + network            = "https://www.googleapis.com/compute/v1/projects/gig-japan-398904/global/networks/int-vpc"
      + project            = "gig-japan-398904"
      + region             = (known after apply)
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":31,"Program":"tfcmt","SHA1":"3c3976ea2e60c2b2a302cd59ef7d010b4161caa7","Vars":{},"WorkflowName":"iaac_plan"} -->